{
  "backend/main.mo": "Motoko canister managing user profiles, products, and order requests with role‑based access control. Provides CRUD‑style queries/mutations for profiles, product lookup, and order submission.",
  "feature_evidence.json": "Feature evidence report listing chatbot‑related feature requests, associated files, components, tests, and metadata.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of many frontend files for quick reference.",
  "frontend/index.css": "Tailwind base layer defining OKLCH CSS variables for light/dark themes plus global background and text styling.",
  "frontend/index.html": "Basic HTML entry point that loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all public, chat, and admin routes using a root layout.",
  "frontend/src/components/admin/AdminGate.tsx": "Protects admin routes by checking admin status and showing loading or unauthorized states.",
  "frontend/src/components/admin/ProductEditorDialog.tsx": "Dialog for creating or editing products with form validation and save handling.",
  "frontend/src/components/admin/UnauthorizedState.tsx": "Displays an access-denied message with login and home navigation options.",
  "frontend/src/components/auth/LoginButton.tsx": "Button handling login/logout via Internet Identity with loading states.",
  "frontend/src/components/SiteFooter.tsx": "Footer with brand info, navigation links including Chat and optional admin link, using admin status for conditional rendering.",
  "frontend/src/components/SiteHeader.tsx": "Responsive header with navigation links, dropdown menus, and cart count.",
  "frontend/src/components/SiteLayout.tsx": "Layout component that wraps pages with header and footer.",
  "frontend/src/data/sampleProducts.ts": "Static list of sample product objects using BigInt values.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous actor, refreshing dependent queries on change.",
  "frontend/src/hooks/useAdminOrders.ts": "Hooks for fetching order requests and individual orders with authorization handling.",
  "frontend/src/hooks/useAdminProducts.ts": "Hooks for adding, updating, and deleting products with query invalidation.",
  "frontend/src/hooks/useAdminStatus.ts": "Determines admin status using actor and identity with reactive loading state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login/logout handling, and identity persistence.",
  "frontend/src/hooks/useOrderRequest.ts": "Defines a React Query mutation hook that submits an order request through an actor and invalidates order-related queries.",
  "frontend/src/hooks/useProducts.ts": "Provides hooks to fetch product lists or single products using an actor, falling back to sample data on failure.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page with brand story, values, and philosophy sections using styled UI components.",
  "frontend/src/pages/admin/AdminIndexPage.tsx": "Admin dashboard linking to order management and product catalog sections.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Lists customer order requests with details, handling loading and error states for admin review.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin page for listing, creating, editing, and deleting products using dialogs and product hooks.",
  "frontend/src/pages/CartPage.tsx": "Implements a shopping cart page with item display, quantity controls, removal, and cart summary navigation.",
  "frontend/src/pages/ChatPage.tsx": "Implements an interactive chatbot page handling user messages, bot responses, quick replies, and navigation intents.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form with validation, simulated submission, and contact information display.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero banner, value propositions, and navigation to shop and about sections.",
  "frontend/src/pages/info/BlogPage.tsx": "Displays a set of predefined blog-style posts about oxidized silver care, styling, gifting, and history.",
  "frontend/src/pages/info/CertificationsQualityPage.tsx": "Shows informational sections about material quality, oxidized finishes, and handcrafted craftsmanship.",
  "frontend/src/pages/info/CollectionsPage.tsx": "Presents jewelry category cards and a section describing oxidized silver with links to shop and contact pages.",
  "frontend/src/pages/info/CustomerReviewsPage.tsx": "Renders customer testimonials with ratings and a prompt for users to share their experiences.",
  "frontend/src/pages/info/CustomizationPage.tsx": "Explains custom design and engraving options, timelines, and steps for submitting personalization requests.",
  "frontend/src/pages/info/FaqPage.tsx": "Renders categorized FAQs with questions and answers about products, ordering, sizing, and shipping. Uses accordions for expandable sections.",
  "frontend/src/pages/info/OrderTrackingPage.tsx": "Displays order tracking instructions, including how references work and what tracking details customers receive. Provides guidance for contacting support for updates.",
  "frontend/src/pages/info/PaymentMethodsPage.tsx": "Explains the inquiry-based payment process and outlines available payment options. Includes cards describing steps and supported methods.",
  "frontend/src/pages/info/PricingOffersPage.tsx": "Details how pricing is determined, available promotions, taxes, and payment flexibility. Uses cards to present clear pricing and offer information.",
  "frontend/src/pages/info/PrivacyPolicyPage.tsx": "Provides the site’s privacy policy covering collected data, usage, and sharing practices. Structurally organized into sections using cards.",
  "frontend/src/pages/info/ReturnsExchangePage.tsx": "Renders the returns and exchange policy page with sections for returns, exchanges, and damaged items using cards and alerts.",
  "frontend/src/pages/info/ShippingDeliveryPage.tsx": "Displays shipping and delivery information including timelines, locations, packaging, and an initial alert.",
  "frontend/src/pages/info/TermsConditionsPage.tsx": "Provides the terms and conditions page with sections outlining usage rules, order process, and product information.",
  "frontend/src/pages/OrderRequestPage.tsx": "Handles order request form, validation, submission, and displays confirmation with reference ID.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Displays detailed product info with images, description, and supports adding items to the cart.",
  "frontend/src/pages/ShopPage.tsx": "Shows a grid of products with images, descriptions, prices, and add‑to‑cart functionality.",
  "frontend/src/state/cart.ts": "Implements a persisted Zustand store for cart items with add, remove, update, clear, and total-price functions.",
  "frontend/src/utils/chatbot.ts": "Defines chatbot message types and an intent-matching system using keyword and phrase scoring to generate responses and quick replies.",
  "frontend/src/utils/urlParams.ts": "Utility functions for getting, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining dark mode, content paths, extended theme settings, custom colors, fonts, animations, and plugin integrations.",
  "project_state.json": "Project metadata describing site scope expansion, architectural constraints, known issues, and existing feature definitions for Lunara Jewels."
}