{
  "backend/main.mo": "Defines an actor with authorization mixin, user profiles, product catalog of static items, and order request types but no dynamic mutation logic shown.",
  "feature_evidence.json": "Contains feature evidence entries mapping features to frontend files, components, and test IDs for catalog display and product-fetch fallback behavior.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for numerous frontend files describing layout, pages, hooks, state, sample data, and styling.",
  "frontend/index.css": "Tailwind CSS base layer defining OKLCH color variables for light and dark themes and applying global background/foreground styles.",
  "frontend/index.html": "Basic HTML shell that mounts the React app and loads main.tsx as the module entry.",
  "frontend/src/App.tsx": "Configures the full TanStack Router route tree, mapping paths to customer, admin, info, and chat pages under a shared layout.",
  "frontend/src/components/admin/AdminGate.tsx": "Checks admin/auth state and shows loader or unauthorized message before rendering children.",
  "frontend/src/components/admin/ProductEditorDialog.tsx": "Product create/edit dialog with form validation and save handling.",
  "frontend/src/components/admin/UnauthorizedState.tsx": "Displays access denied UI with login option and home navigation.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with status handling.",
  "frontend/src/components/SiteFooter.tsx": "Renders the footer with brand info, quick links, support links, and conditional admin dashboard link based on admin status.",
  "frontend/src/components/SiteHeader.tsx": "Responsive site header with logo, navigation links, dropdowns, and cart indicator.",
  "frontend/src/components/SiteLayout.tsx": "Page layout wrapper including header, footer, and routed content outlet.",
  "frontend/src/config/contact.ts": "Centralized exported contact info constants for the site.",
  "frontend/src/data/sampleProducts.ts": "Static list of sample product objects with IDs, descriptions, and images.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actor based on identity and refreshes dependent queries.",
  "frontend/src/hooks/useAdminOrders.ts": "Hooks for listing and retrieving order requests with authorization handling.",
  "frontend/src/hooks/useAdminProducts.ts": "Product CRUD mutation hooks that call actor methods and invalidate caches.",
  "frontend/src/hooks/useAdminStatus.ts": "Hook to check admin privileges using actor and Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, exposing identity state, login, and logout helpers.",
  "frontend/src/hooks/useOrderRequest.ts": "Defines a React Query mutation hook that submits an order request through an actor and invalidates order request queries on success.",
  "frontend/src/hooks/useProducts.ts": "Fetches products via an actor with fallbacks to sample data and normalizes image URLs, ensuring at least 20 products are returned.",
  "frontend/src/index.css": "Sets up Tailwind CSS base styles and defines light and dark theme CSS variables for the app.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Displays the brand’s story, values, and philosophy using styled sections and icon-accompanied content cards.",
  "frontend/src/pages/admin/AdminIndexPage.tsx": "Admin dashboard landing page linking to order management and product catalog sections.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin page that lists customer order requests with loading, error handling, and detailed order cards.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin product management page supporting listing, adding, editing, and deleting products with dialogs and mutation hooks.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart with item management, quantity controls, and an order summary, handling empty-cart states.",
  "frontend/src/pages/ChatPage.tsx": "Implements a chatbot interface with message history, quick replies, navigation intents, and automated bot responses.",
  "frontend/src/pages/ContactPage.tsx": "Contact form with validation, simulated submission, and contact info display.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing hero banner and brand value sections with links to shop and about pages.",
  "frontend/src/pages/info/BlogPage.tsx": "Static blog page displaying multiple jewelry-related articles with icons, summaries, and content sections.",
  "frontend/src/pages/info/CertificationsQualityPage.tsx": "Static info page describing product quality, materials, oxidation process, and craftsmanship using several card sections.",
  "frontend/src/pages/info/CollectionsPage.tsx": "Collections overview page listing jewelry categories and providing details about oxidized silver with links to shop and contact pages.",
  "frontend/src/pages/info/CustomerReviewsPage.tsx": "Displays customer testimonials with ratings and a prompt to share experiences.",
  "frontend/src/pages/info/CustomizationPage.tsx": "A page describing options for custom jewelry, engraving, and timelines, with guidance on how to submit custom design details.",
  "frontend/src/pages/info/FaqPage.tsx": "Displays categorized FAQs about products, ordering, sizing, and shipping using accordion components.",
  "frontend/src/pages/info/OrderTrackingPage.tsx": "Explains how order tracking works, the role of the Order Reference number, and how customers receive updates.",
  "frontend/src/pages/info/PaymentMethodsPage.tsx": "Outlines the inquiry-based payment process and lists available payment methods arranged after order confirmation.",
  "frontend/src/pages/info/PricingOffersPage.tsx": "Details pricing transparency, special offers, taxes, and mentions payment options for handcrafted jewelry.",
  "frontend/src/pages/info/PrivacyPolicyPage.tsx": "Renders the privacy policy page with sections describing data collection, usage, and sharing. Uses Card components to structure detailed policy text.",
  "frontend/src/pages/info/ReturnsExchangePage.tsx": "Displays the returns and exchange policy with requirements, timelines, and guidance via Card and Alert components. Includes sections for returns, exchanges, and damaged items.",
  "frontend/src/pages/info/ShippingDeliveryPage.tsx": "Shows shipping and delivery details including timelines, locations, and packaging info. Uses Card and Alert components to outline key shipping policies.",
  "frontend/src/pages/info/TermsConditionsPage.tsx": "Provides terms and conditions including website use, order process, and product information. Structured with Card components and dynamic last-updated date.",
  "frontend/src/pages/OrderRequestPage.tsx": "Order submission form that validates user info, sends order request, clears cart, and shows confirmation.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Displays detailed product info, images, description, and allows adding items to the cart.",
  "frontend/src/pages/ShopPage.tsx": "Lists products with loading state, product previews, and add‑to‑cart functionality.",
  "frontend/src/state/cart.ts": "Implements a persisted Zustand store managing cart items with add, remove, update, clear, and total price calculation functions.",
  "frontend/src/utils/chatbot.ts": "Defines chatbot message types, text normalization, intent scoring, and a catalog of intents with responses and quick replies for user queries.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters from query or hash, persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom fonts, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s current scope, architectural constraints, known issues, and existing features for the Lunara Jewels site."
}