{
  "kind": "build_request",
  "title": "Show all 20 products in the Shop collection grid",
  "projectName": "Lunara Jewels",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-35",
      "text": "Ensure the customer-facing Shop collection page (\"Our Collection\" in frontend/src/pages/ShopPage.tsx) displays all 20 products by default whenever the catalog contains 20 items (from backend listProducts or from the frontend fallback sampleProducts).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "i want you to display all 20 products in the collection"
        ]
      },
      "acceptanceCriteria": [
        "When the backend returns 20 products from listProducts(), the Shop page renders 20 product cards (no pagination, slicing, or hidden items).",
        "When the backend is unavailable or the actor is not ready, the Shop page renders the 20 fallback products from frontend/src/data/sampleProducts.ts.",
        "The Shop page does not render an empty grid due to a disabled query/actor-loading state; it shows either loading skeletons or the 20 fallback products until backend data is available."
      ]
    },
    {
      "id": "REQ-36",
      "text": "Update the product-list fetching logic in frontend/src/hooks/useProducts.ts so that it never results in fewer than 20 displayed products due solely to actor initialization/query enablement; if the backend returns fewer than 20 products (or returns an empty array unexpectedly), merge/fallback to the 20-item sampleProducts list so the Shop collection view still shows all 20 items.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "i want you to display all 20 products in the collection"
        ]
      },
      "acceptanceCriteria": [
        "If actor.listProducts() throws, returns null/undefined, or returns an empty array, use the 20-item sampleProducts list.",
        "If actor.listProducts() returns between 1 and 19 products, the Shop page still renders 20 product cards by filling missing items from sampleProducts (without duplicate IDs in the rendered list).",
        "Image URL normalization (productImageMap/normalizeProductImage) still applies to backend-returned items after this change."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only components); compose them as-is.",
    "Keep the existing lightweight inquiry-based ordering model unchanged (no online checkout or accounts)."
  ],
  "nonGoals": [
    "Do not add new products beyond the existing 20-item catalog.",
    "Do not change product pricing, names, or descriptions as part of this request unless required to fix missing/duplicate IDs that prevent rendering all 20 items.",
    "Do not add new pages or navigation changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}