{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Lunara Jewels — More conversational, question-specific rule-based chatbot",
  "requirements": [
    {
      "id": "REQ-25",
      "summary": "Implement deterministic intent scoring to select the most specific best-matching chatbot intent (punctuation/whitespace tolerant) with a confidence threshold and clarifying fallback.",
      "acceptanceCriteria": [
        "When a user message matches both a broad intent (e.g., “shop”) and a more specific intent (e.g., “rings”, “shipping”, “returns”, “payment”), the chatbot selects the more specific intent.",
        "The intent matching tolerates punctuation and extra whitespace without changing the selected intent.",
        "If no intent meets a reasonable confidence threshold, the chatbot asks 1–2 clarifying questions instead of giving a generic unrelated answer."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/chatbot.ts",
          "operation": "modify",
          "description": "Replace the current response selection with a deterministic scoring matcher: normalize user text (lowercase, trim, collapse whitespace, ignore punctuation), score each intent by best/total keyword & phrase matches (prefer longer phrase matches, multiple matches, and specificity), add tie-breakers that avoid broad-intent over-triggering (e.g., deprioritize generic 'shop' when a higher-specificity intent matches), and introduce a confidence threshold that returns a short clarifying-question response + relevant quick replies when no intent confidently matches."
        }
      ]
    },
    {
      "id": "REQ-26",
      "summary": "Refactor chatbot responses to be more conversational and topic-specific with direct-first answers, optional follow-up questions, and 2–4 relevant quick replies aligned to site capabilities.",
      "acceptanceCriteria": [
        "For matched intents, the first sentence of the bot response directly answers the user’s question (no generic preamble).",
        "Responses include conversational elements (brief acknowledgement + optional follow-up question) without adding unsupported claims (e.g., no online checkout, no customer accounts, no guaranteed payment methods, no physical store unless explicitly stated elsewhere).",
        "Quick replies shown after each bot answer are relevant to the detected topic (e.g., shipping answers include links like “Shipping details”/navigate-shipping, returns answers include navigate-returns, payment answers include navigate-payment, ordering answers include navigate-order)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/chatbot.ts",
          "operation": "modify",
          "description": "Rewrite/refactor intent responses to a consistent conversational template: direct answer in the first sentence, brief acknowledgement of the topic, optional single follow-up question, and 2–4 topic-relevant quick replies. Ensure quick replies include the appropriate navigation intents for shipping (/shipping), returns (/returns), payment (/payment-methods), ordering (/order-request), and contact (/contact) while avoiding any copy that implies online checkout/accounts or unsupported guarantees."
        }
      ]
    },
    {
      "id": "REQ-27",
      "summary": "Update /chat helper copy to encourage specific questions, set expectations about clarifying follow-ups, and provide a clear escalation path to Contact.",
      "acceptanceCriteria": [
        "The helper text on /chat encourages users to ask a specific question and mentions the bot may ask a short clarifying question when needed.",
        "The helper text includes an explicit escalation path to the Contact page for complex/out-of-scope questions.",
        "All user-facing text is in English and remains consistent with the inquiry-based ordering model (no suggestion of instant online checkout)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ChatPage.tsx",
          "operation": "modify",
          "description": "Revise the intro/helper paragraph copy above the chat UI to: (1) encourage users to ask a specific question, (2) note the assistant may ask 1–2 quick follow-up questions if details are missing, and (3) explicitly direct users to the Contact page for complex or out-of-scope requests—without suggesting instant checkout or account features."
        }
      ]
    }
  ]
}