{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Lunara Jewels — Always render all 20 products on Shop collection grid",
  "requirements": [
    {
      "id": "REQ-35",
      "summary": "Ensure ShopPage renders 20 product cards by default (backend 20, or 20-item fallback) without being blocked by actor/query loading states.",
      "acceptanceCriteria": [
        "When the backend returns 20 products from listProducts(), the Shop page renders 20 product cards (no pagination, slicing, or hidden items).",
        "When the backend is unavailable or the actor is not ready, the Shop page renders the 20 fallback products from frontend/src/data/sampleProducts.ts.",
        "The Shop page does not render an empty grid due to a disabled query/actor-loading state; it shows either loading skeletons or the 20 fallback products until backend data is available."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ShopPage.tsx",
          "operation": "modify",
          "description": "Update the rendering logic to always map over a non-empty 20-item list returned by useProducts (fallback/merged), preventing an empty grid when query data is temporarily undefined. Keep the existing 20-skeleton loading state, and adjust/remove the empty-state message so it cannot appear when fallback products are available."
        }
      ]
    },
    {
      "id": "REQ-36",
      "summary": "Harden useProducts to always produce a 20-item product list by merging backend results with sampleProducts when needed, without breaking image normalization.",
      "acceptanceCriteria": [
        "If actor.listProducts() throws, returns null/undefined, or returns an empty array, use the 20-item sampleProducts list.",
        "If actor.listProducts() returns between 1 and 19 products, the Shop page still renders 20 product cards by filling missing items from sampleProducts (without duplicate IDs in the rendered list).",
        "Image URL normalization (productImageMap/normalizeProductImage) still applies to backend-returned items after this change."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useProducts.ts",
          "operation": "modify",
          "description": "Change the query enablement/return shape so actor initialization cannot cause fewer than 20 displayed items. Ensure queryFn returns sampleProducts when actor is missing or actor is still fetching. When backend returns 1–19 items, normalize backend items with normalizeProductImage, then fill up to 20 using sampleProducts entries whose IDs are not already present (no duplicate rendered IDs). Keep returning backend items as-is (no slicing) when 20 items are returned."
        }
      ]
    }
  ]
}